note/sqoop.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>sqoop使用</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">sqoop使用</h1>
<p>
Sqoop是一个用于Hadoop和关系型数据库或主机之间的数据传输工具。<br>
它可以将数据从关系型数据库import到HDFS，也可以从HDFS export到关系型数据库,<br>
Sqoop只是RDBMS与HDFS直接数据转换工具，导入数据和导出数据，<br>
都是通过Hadoop的MapReduce实现,充分利用分布式计算的功能。<br>
</p>

<p>
Sqoop是一款基于Hadoop系统的数据转移工具，因此在安装Sqoop之前需要先安装<br>
好Hadoop<br>
</p>


<p>
首先测试 sqoop与mysql的连通性<br>
</p>

<pre class="example">
sqoop list-databases --connect jdbc:mysql://slave01:3306/ --username root --password manue1

</pre>

<p>
这里导入导出数据使用,hive库中的user表信息<br>
</p>

<ul class="org-ul">
<li><b>从hive/hdfs导出到mysql</b><br></li>
</ul>

<p>
从hive导出数据到mysql，本质上就是将hdfs上文件导出到本地mysql库，<br>
比如现在要导出hive中hdb.user_orc表的数据,此表在hdfs上存放的路径是<br>
 <code>/user/hive/warehouse/hdb.db/user_orc</code> ,也就是将此目录下文件<br>
内容导出到mysql<br>
</p>

<p>
导出前在mysql中创建表:<br>
</p>

<pre class="example">
create database sqoopdb;
use sqoopdb;
create table my_user(uploader VARCHAR(64),videos int,friends int)

</pre>

<p>
sqoop导出命令:<br>
</p>

<pre class="example">
sqoop export -m 1 --connect jdbc:mysql://slave01:3306/sqoopdb --username root --password manue1 --table my_user --export-dir  /user/hive/warehouse/hdb.db/user_text --input-fields-terminated-by '\t' --mysql-delimiters

</pre>




<ul class="org-ul">
<li><b>从mysql导入hdfs</b><br></li>
</ul>

<pre class="example">
sqoop import --connect jdbc:mysql://slave01:3306/sqoopdb --username root --password manue1 --split-by friends --table my_user --hive-import --create-hive-table --hive-table hdb.mysql_to_hive --hive-overwrite --target-dir /user/hive/warehouse/hdb.db/mysql_to_hive

</pre>


<ul class="org-ul">
<li><p>
结论<br>
</p>

<p>
目前sqoop调研看，只是用来对于关系型数据库与hdfs直接数据传输，很难满足json等结构复杂的数据传输</p></li>
</ul>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>